<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#groupby" data-toc-modified-id="groupby-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>groupby</a></span><ul class="toc-item"><li><span><a href="#groupby-&amp;-aggregate" data-toc-modified-id="groupby-&amp;-aggregate-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>groupby &amp; aggregate</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Pivot Tables</a></span></li><li><span><a href="#Differences-between-pivot-table-and-groupby-function" data-toc-modified-id="Differences-between-pivot-table-and-groupby-function-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Differences between pivot table and groupby function</a></span></li><li><span><a href="#crosstab" data-toc-modified-id="crosstab-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>crosstab</a></span></li></ul></li><li><span><a href="#Data-combination:-mixing-dataframes" data-toc-modified-id="Data-combination:-mixing-dataframes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data combination: mixing dataframes</a></span><ul class="toc-item"><li><span><a href="#Concat:-two-things-together" data-toc-modified-id="Concat:-two-things-together-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Concat: two things together</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge:-related-columns" data-toc-modified-id="Merge:-related-columns-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Merge: related columns</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-&amp;-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-&amp;-Concatenating-in-two-different-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Merging &amp; Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Join:-relating-index" data-toc-modified-id="Join:-relating-index-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Join: relating index</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

![](https://miro.medium.com/max/1400/1*6d5dw6dPhy4vBp2vRW6uzw.webp)

First, we import the main libraries:

In [44]:
import pandas as pd
import numpy as np

Now, is time to load a new dataset.

In [45]:
df = pd.read_csv("./datasets/employees.csv")

what is it about? Let's look at it all together:

In [46]:
# time to code

## Data aggregation

Data aggregation is a fundamental technique in data analysis that involves grouping and summarizing data to gain insights and make informed decisions. In this section, we will explore essential Pandas methods for data aggregation, including `groupby`, `pivot_table`, and `crosstab`.

These techniques are particularly useful when dealing with large datasets or when you need to summarize data across different categories or dimensions. Whether you want to calculate statistics for specific groups, create summary tables, or analyze relationships between variables, data aggregation methods in Pandas provide the tools to streamline your analysis.

Let's dive into each of these methods and discover how they can help you uncover meaningful patterns and trends within your data.

### groupby

Pandas GroupBy is a powerful and versatile function in Python that is indispensable for data manipulation and analysis. It enables us to split a DataFrame into separate groups based on one or more criteria and perform various calculations on these groups for in-depth analysis.

The concept is straightforward: you select a DataFrame, specify the categories or criteria by which you want to group your data, and then apply aggregation functions to each group. These aggregation functions can include calculations like sum, mean, count, or even custom-defined functions, depending on your analysis goals.

GroupBy operations are invaluable for tasks such as summarizing data, exploring patterns within specific groups, or comparing different segments of your dataset. Whether you're working with sales data, customer behavior, or any other structured data, Pandas GroupBy is your go-to tool.

Here's a basic syntax to use GroupBy:

`df[subset].groupby(category).aggregation()`

To dive deeper into the capabilities and options of Pandas GroupBy, you can refer to the official documentation [here](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html).

`groupby the departments and their mean age`

In [47]:
# There are two ways of doing it (1st)
df[["Age", "Department"]].groupby("Department").mean()

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

In [48]:
# There are two ways of doing it (2nd)
df[["Age", "Department"]].groupby("Department").agg("mean")

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`groupby the departments and their maximum age`

In [49]:
# There are two ways of doing it (1st)
df[["Age", "Department"]].groupby("Department").agg({"Age":"max"})

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

In [50]:
# There are two ways of doing it (2nd)
df[["Age", "Department"]].groupby("Department").max()

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`groupby the departments and their min age`

In [51]:
# There are two ways of doing it (1st)
df[["Age", "Department"]].groupby("Department").agg({"Age":"min"})

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

In [52]:
# There are two ways of doing it (2nd)
df[["Age", "Department"]].groupby("Department").min()

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`groupby: 2+`: Different Education Fields and their Mean Salaries in each of the Department

In [53]:
df[["EducationField", "HourlyRate", "Department"]].groupby(by=["Department", "EducationField"]).agg({"HourlyRate":"mean"})

                                         HourlyRate
Department             EducationField
Human Resources        Human Resources    60.888889
                       Life Sciences      61.625000
                       Medical            72.076923
                       Other              76.000000
                       Technical Degree   64.000000
Research & Development Life Sciences      66.570455
                       Medical            66.330579
                       Other              62.203125
                       Technical Degree   66.351064
Sales                  Life Sciences      68.153333
                       Marketing          66.150943
                       Medical            59.943182
                       Other              60.333333
                       Technical Degree   67.676471

In [54]:
df[["EducationField", "HourlyRate", "Department"]].groupby(by=["EducationField", "Department"]).agg({"HourlyRate":"mean"})

                                         HourlyRate
EducationField   Department
Human Resources  Human Resources          60.888889
Life Sciences    Human Resources          61.625000
                 Research & Development   66.570455
                 Sales                    68.153333
Marketing        Sales                    66.150943
Medical          Human Resources          72.076923
                 Research & Development   66.330579
                 Sales                    59.943182
Other            Human Resources          76.000000
                 Research & Development   62.203125
                 Sales                    60.333333
Technical Degree Human Resources          64.000000
                 Research & Development   66.351064
                 Sales                    67.676471

`more fields`

In [55]:
df[["EducationField", "HourlyRate", "Department", "StandardHours", "Age"]].groupby(by=["Department", "EducationField"]).mean()

                                         HourlyRate  StandardHours        Age
Department             EducationField
Human Resources        Human Resources    60.888889           80.0  37.037037
                       Life Sciences      61.625000           80.0  39.375000
                       Medical            72.076923           80.0  39.846154
                       Other              76.000000           80.0  34.666667
                       Technical Degree   64.000000           80.0  32.500000
Research & Development Life Sciences      66.570455           80.0  36.997727
                       Medical            66.330579           80.0  37.242424
                       Other              62.203125           80.0  36.187500
                       Technical Degree   66.351064           80.0  37.063830
Sales                  Life Sciences      68.153333           80.0  37.186667
                       Marketing          66.150943           80.0  37.924528
                       Medical            59.943182           80.0  34.727273
                       Other              60.333333           80.0  32.000000
                       Technical Degree   67.676471           80.0  33.941176

#### groupby & aggregate

In Pandas, the "agg" function is a powerful tool for aggregating data within groups created using the GroupBy operation. It allows you to apply multiple aggregation functions simultaneously, providing concise and flexible control over your data summarization.

Here are some common aggregation functions that can be used with the "agg" syntax:
- **mean**: Calculates the mean (average) of the values in each group.
- **sum**: Adds up all the values in each group.
- **count**: Counts the number of rows in each group.

Using the "agg" function, you can specify these aggregation functions and more, tailoring your data summarization to match your specific analysis requirements. This flexibility is especially useful when you need to obtain various statistics from your grouped data simultaneously.

For more details and advanced options regarding the "agg" function, you can refer to the official Pandas documentation [here](https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html).

### Pivot Tables

In data analysis, pivot tables are a valuable tool for reshaping and summarizing data, especially when you need to analyze and compare multiple aspects of your dataset simultaneously. Pandas provides a versatile `pivot_table` function that allows you to create spreadsheet-style pivot tables within your DataFrame.

The `pivot_table` function takes several key parameters:
- `df`: The DataFrame you want to pivot.
- `values`: The columns containing the values you want to aggregate.
- `index`: The columns that will become the new index of the pivot table.
- `columns`: The columns that will become the new columns of the pivot table.
- `aggfunc`: The aggregation function to be applied to the values (default is 'mean').

When you apply the `pivot_table` function, it organizes your data into a more structured format, with hierarchical indexing on both rows and columns. This structure makes it easy to perform various aggregation operations, such as calculating means, sums, or counts across different groups and dimensions.

For a detailed comparison of when to use `groupby` versus `pivot_table`, you can refer to this informative article: [GroupBy vs. Pivot Table](https://towardsdatascience.com/a-comparison-of-groupby-and-pivot-in-pythons-pandas-module-527909e78d6b).

Utilizing pivot tables effectively can significantly enhance your data analysis capabilities and help you uncover insights from complex datasets.

To learn more about the `pivot_table` function and its advanced options, you can refer to the official Pandas documentation [here](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html).

`pivot table`: the department and their mean ages

In [56]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [57]:
# Example, calculating mean age by department
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "mean"
)

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

Now, is your **turn**:

`pivot table`: the department and their max ages

In [58]:
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "max"
)

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`pivot table`: the department and their min ages

In [59]:
#  `pivot table`: the department and their min ages
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "min"
)

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`pivot table`: the department and their median age

In [60]:
# `pivot table`: the department and their mean ages
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "mean"
)

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`multi-index pivot table`: Department and Education Field and check the maximum salary values of employees

In [61]:
# Example, calculating mean age by department and EducationField

df.pivot_table (
    values = "MonthlyIncome",
    index = ["Department", "EducationField"],
    aggfunc = "max"
)

                                         MonthlyIncome
Department             EducationField
Human Resources        Human Resources           19636
                       Life Sciences             19717
                       Medical                   18200
                       Other                      7988
                       Technical Degree           4323
Research & Development Life Sciences             19999
                       Medical                   19859
                       Other                     19613
                       Technical Degree          19943
Sales                  Life Sciences             19847
                       Marketing                 19845
                       Medical                   19833
                       Other                     10932
                       Technical Degree          16872

### crosstab

In data analysis, understanding the relationships between categorical variables is often crucial for gaining insights into your dataset. Pandas offers a powerful tool called `crosstab` that helps you compute a simple cross-tabulation of two or more factors within your DataFrame.

The `pd.crosstab()` function is designed for this purpose and is particularly useful when you want to examine the frequency or distribution of one categorical variable relative to another. By default, it computes a frequency table, but you can also pass an array of values and an aggregation function for more advanced analysis.

Here's the basic syntax:
```python
pd.crosstab(df[column1], df[column2])
```

In [62]:
# Example I
pd.crosstab(df["Department"], df["EducationField"])

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,27,16,0,13,3,4
Research & Development,0,440,0,363,64,94
Sales,0,150,159,88,15,34

In [63]:
# Example II
pd.crosstab(df["Department"], df["EducationField"], df["MonthlyIncome"], aggfunc="mean")

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,7241.148148,6914.062500,NaN,6594.076923,5016.666667,3081.250000
Research & Development,NaN,6179.984091,NaN,6539.223140,6278.687500,5760.819149
Sales,NaN,7246.233333,7348.584906,6377.227273,5398.733333,6066.294118

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

## Data combination: mixing dataframes

In real-world data analysis, you often encounter scenarios where you need to combine data from different sources or organize it differently to perform meaningful analysis. Pandas provides several powerful methods for merging, joining, and concatenating DataFrames to help you manage this process efficiently.

For a comprehensive understanding of these techniques, consider exploring the following resources:
- [Real Python: Pandas Merge, Join, and Concat](https://realpython.com/pandas-merge-join-and-concat/)
- [Pandas Documentation: Merging and Joining](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

### Concat: two things together
Concatenation is one of the fundamental operations for combining DataFrames. With `pd.concat()`, you can effortlessly join DataFrames along a specified axis, usually along axis 0 (vertically), to stack them one below the other. This aligns columns based on their labels, making it a valuable tool for extending or appending data vertically.

The basic syntax for concatenation is as follows:
```python
result = pd.concat([df1, df2, ...], axis=0)
```
Here, `df1`, `df2`, and so on are the DataFrames you want to concatenate. The `axis=0` argument ensures that the concatenation occurs vertically, aligning rows.

By mastering concatenation, you can efficiently manage datasets that grow over time or combine data from various sources into a single cohesive DataFrame. This is particularly useful when dealing with time series data, log files, or other situations where data is collected incrementally.

To delve deeper into concatenation and explore more advanced options, you can refer to the provided resources and the official Pandas documentation on [pd.concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html).

In [64]:
# Load some data
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')

In [65]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [66]:
# Let's sample it
first_df = df.sample(frac=0.1)
second_df = df.sample(frac=0.1)

In [67]:
second_df

         age gender     occupation zip_code
user_id
689       25      M          other    45439
676       30      M     programmer    32712
186       39      F      executive    00000
351       61      M       educator    49938
914       44      F          other    08105
...      ...    ...            ...      ...
241       26      F        student    20001
47        53      M      marketing    07102
562       54      F  administrator    20879
900       60      M        retired    18505
201       27      M         writer    E2A4H

[94 rows x 4 columns]

In [68]:
second_df.shape

(94, 4)

#### Concatenating on axis 0 (rows)

In [69]:
pd.concat([first_df, second_df], axis=0, keys=["Table 1", "Table 2"])

                 age gender     occupation zip_code
        user_id
Table 1 675       34      M          other    28814
        537       36      M       engineer    22902
        269       31      F      librarian    43201
        396       57      M       engineer    94551
        547       50      M       educator    14534
...              ...    ...            ...      ...
Table 2 241       26      F        student    20001
        47        53      M      marketing    07102
        562       54      F  administrator    20879
        900       60      M        retired    18505
        201       27      M         writer    E2A4H

[188 rows x 4 columns]

- This operation concatenates the DataFrames `first_df` and `second_df` vertically (along `axis=0`), meaning it stacks them on top of each other.

- The `keys` parameter is used to specify a hierarchical index for the resulting DataFrame. In this case, you're giving each original DataFrame a label: "Table 1" and "Table 2."

- As a result, the output will be a new DataFrame with a hierarchical (MultiIndex) structure. You can think of it as having two sections labeled "Table 1" and "Table 2," where each section contains the data from the respective original DataFrame.

#### Concatenating on axis 1 (columns)

In [70]:
pd.concat([first_df, second_df], axis=1, keys=["left", "right"])

         left                            right
          age gender occupation zip_code   age gender     occupation zip_code
user_id
675      34.0      M      other    28814   NaN    NaN            NaN      NaN
537      36.0      M   engineer    22902   NaN    NaN            NaN      NaN
269      31.0      F  librarian    43201   NaN    NaN            NaN      NaN
396      57.0      M   engineer    94551   NaN    NaN            NaN      NaN
547      50.0      M   educator    14534   NaN    NaN            NaN      NaN
...       ...    ...        ...      ...   ...    ...            ...      ...
241       NaN    NaN        NaN      NaN  26.0      F        student    20001
47        NaN    NaN        NaN      NaN  53.0      M      marketing    07102
562       NaN    NaN        NaN      NaN  54.0      F  administrator    20879
900       NaN    NaN        NaN      NaN  60.0      M        retired    18505
201       NaN    NaN        NaN      NaN  27.0      M         writer    E2A4H

[177 rows x 8 columns]

- This operation concatenates the DataFrames `first_df` and `second_df` horizontally (along `axis=1`), meaning it combines them side by side.

- Similar to the first operation, the `keys` parameter is used to label the columns resulting from each original DataFrame. Here, you're labeling them as "left" and " right."

- The output will be a new DataFrame where the columns are organized into two sections labeled "left" and " right," representing the data from the respective original DataFrames.

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

### Merge: related columns

The `merge()` function in Pandas is a powerful tool when you need to combine rows from multiple DataFrames based on related columns. It's primarily used for database-style joins where you want to bring together data from different sources that share common key columns.

**Understanding the `merge()` Function**:

You can think of the `merge()` function as a way to merge rows that share data across specified columns. It allows you to perform various types of joins, such as inner, outer, left, and right joins, which determine how rows from both DataFrames are combined.

- **Inner Join**: This type of join returns only the rows where there is a match in both DataFrames based on the specified columns. Rows without a match are excluded.

- **Outer Join (Full Outer Join)**: An outer join returns all rows when there is a match in either the left or right DataFrame. Unmatched rows will contain NaN values for the missing data.

- **Left Join (Left Outer Join)**: A left join returns all rows from the left DataFrame and the matched rows from the right DataFrame. Unmatched rows from the left DataFrame will still be included.

- **Right Join (Right Outer Join)**: Conversely, a right join returns all rows from the right DataFrame and the matched rows from the left DataFrame. Unmatched rows from the right DataFrame will still be included.

**Usage and Syntax**:

Here's a basic outline of how to use the `merge()` function:

```python
merged_df = pd.merge(left_df, right_df, on='common_column', how='join_type')
```
- **Usage and Syntax:**

  - `left_df`: The left DataFrame you want to merge.
  - `right_df`: The right DataFrame you want to merge.
  - `on`: The column(s) on which you want to perform the merge. These columns should exist in both DataFrames and serve as the key(s) for the merge operation.
  - `how`: The type of join you want to perform (e.g., 'inner', 'outer', 'left', 'right').

- **Benefits of Using `merge()`:**

  - **Data Integration:** Merge helps integrate data from multiple sources or tables into a single, comprehensive dataset.

  - **Data Analysis:** It simplifies the process of combining related information, making it easier to analyze data and derive insights.

  - **Database Operations:** `merge()` aligns with common database operations like SQL joins, allowing data analysts to leverage their SQL knowledge within Pandas.

  - **Complex Queries:** You can handle complex data relationships and perform queries that involve multiple tables efficiently.

Merging DataFrames using `merge()` is a fundamental operation in data manipulation and analysis, especially when dealing with real-world datasets from various sources. It provides you with the flexibility to control how data is combined and allows you to work with complex data relationships.

For more detailed information and options, you can refer to the official Pandas documentation on [`merge()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html).

#### LEFT Merge

In [71]:
from IPython.display import display_html

In [72]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [73]:
# Just showing tables
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [74]:
# merge, default is inner
pd.merge(df1, df2)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [75]:
# merges, now is a left
pd.merge(df1, df2, how="left")

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [76]:
# merges, now is a right
pd.merge(df1, df2, how="right")

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [77]:
# merge, now is inner
pd.merge(df1, df2, how="inner")

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [78]:
# merge, now is outer
outer_merge = pd.merge(df1, df2, how="outer")

### Merging & Concatenating in two different columns

In [79]:
df1_docs = pd.DataFrame({'Locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Barcelona", "Paris", "Lisbon", "Madrid"]})
df2_docs = pd.DataFrame({'More locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Madrid", "Lyon", "Porto", "Albacete"]})

#### Concatenating in two different columns

In [80]:
pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

  1st table                 2nd table
  Locations       city More locations      city
0     Spain  Barcelona          Spain    Madrid
1    France      Paris         France      Lyon
2  Portugal     Lisbon       Portugal     Porto
3     Spain     Madrid          Spain  Albacete

#### Merging in two different columns

In [81]:
df1_docs.merge(df2_docs, left_on='Locations', right_on='More locations', suffixes = ["_fromlastyear", "_fromthisyear"])

  Locations city_fromlastyear More locations city_fromthisyear
0     Spain         Barcelona          Spain            Madrid
1     Spain         Barcelona          Spain          Albacete
2     Spain            Madrid          Spain            Madrid
3     Spain            Madrid          Spain          Albacete
4    France             Paris         France              Lyon
5  Portugal            Lisbon       Portugal             Porto

In [82]:
df1_docs.merge(df2_docs,  left_on='Locations', right_on='More locations', suffixes = ["_fromleft", "_fromright"])

  Locations city_fromleft More locations city_fromright
0     Spain     Barcelona          Spain         Madrid
1     Spain     Barcelona          Spain       Albacete
2     Spain        Madrid          Spain         Madrid
3     Spain        Madrid          Spain       Albacete
4    France         Paris         France           Lyon
5  Portugal        Lisbon       Portugal          Porto

### Join: relating index
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [83]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [84]:
left_df = pd.DataFrame({"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"])
right_df = pd.DataFrame({"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"])

In [85]:
left_df.join(right_df, how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

### Differences between join & merge
When combining DataFrames in Pandas, you have two primary methods at your disposal: `join()` and `merge()`. Each method has its own set of features and use cases. Below is a comparison of these two methods based on different join features:

| Join Feature               | `join()` | `merge()` |
|----------------------------|:--------:|:---------:|
| Inner Join                 |   Yes    |    Yes    |
| Left Join                  |   Yes    |    Yes    |
| Right Join                 |   Yes    |    Yes    |
| Outer Join                 |   Yes    |    Yes    |
| Cross Join                |    X     |    Yes    |
| Join on Indices            |   Yes    |    Yes    |
| Join on Columns            |    X     |    Yes    |
| Left on Column, Right on Index |   Yes    |    Yes    |
| Left on Index, Right on Column |    X     |    Yes    |

**Explanation:**

- **Inner Join:** Both `join()` and `merge()` support inner joins, which return only the rows with matching values in both DataFrames.

- **Left Join:** Both methods allow left joins, which include all rows from the left DataFrame and matching rows from the right DataFrame.

- **Right Join:** Both methods support right joins, which include all rows from the right DataFrame and matching rows from the left DataFrame.

- **Outer Join:** Both methods enable outer joins, which include all rows from both DataFrames, filling in missing values with NaN where necessary.

- **Cross Join:** While `merge()` can perform cross joins, `join()` does not support them. Cross joins result in a Cartesian product of rows between two DataFrames.

- **Join on Indices:** Both `join()` and `merge()` can perform joins based on the index of DataFrames.

- **Join on Columns:** `merge()` allows you to join DataFrames on specific columns, while `join()` does not provide this capability.

- **Left on Column, Right on Index:** Both methods support joining on a column from the left DataFrame and the index from the right DataFrame.

- **Left on Index, Right on Column:** `merge()` can join on the index from the left DataFrame and a column from the right DataFrame, but `join()` does not offer this option.

This comparison should help you choose the appropriate method based on your specific merging requirements.

## Business challenge: Glovo orders analysis (use pycharm)

In this analysis, we will explore a dataset containing information about orders from Fake partners within the app. Fake partners are stores not directly integrated with Glovo, and our content team manages their product catalog and prices. This dataset provides details on orders, payment discrepancies, and other relevant information.

1. Dataset Description
    - `order_id`: Unique identifier for each order.
    - `activation_time_local`: Local time when the order was activated.
    - `country_code`: Country code for the order.
    - `store_address`: Address of the store.
    - `final_status`: The final status of the order.
    - `payment_status`: The payment status of the order.
    - `products`: Number of products in the order.
    - `products_total`: Total amount at checkout in euros (€).
    - `purchase_total_price`: Amount the courier paid at the store in euros (€).

2. Background
Fake partner orders can exhibit discrepancies between the total amount at checkout (`products_total`) and the amount the courier pays at the store (`purchase_total_price`). When `products_total` is lower than `purchase_total_price`, we classify them as "under-authorized orders." Understanding these discrepancies is crucial for transitioning from charge-on-delivery to an authorize-and-capture model.

3. Key Questions
During this EDA process, we aim to answer the following questions:

    1. What percentage of orders are under-authorized?
    2. What percentage of orders would be correctly authorized with a 20% incremental authorization on the amount at checkout?
    3. Are there differences in the above percentages when split by country?
    4. For the remaining orders outside of incremental authorization, what values would be necessary to capture the remaining amount?
    5. Which stores are the most problematic in terms of orders and monetary value?
    6. For under-authorized orders, is there a correlation between the price difference and order cancellations? In other words, is an order more likely to be canceled as the price difference increases?

Through this analysis, we aim to gain insights into the price fluctuations of past orders and assess the risk associated with transitioning to a new authorization model.

Let's dive into the dataset and start exploring!

In [86]:
# Load the dataset
df = pd.read_csv("./datasets/fake_orders_test.csv")

## RECAP

## Subsets
- Select specific columns:
  - `df[[col1, col2]]`

## Aggregations
### Groupby
- Perform aggregations based on a categorical column:
  - `df[[col1, col2]].groupby(CATEGORICAL).agg({QUANTITATIVE_1: "mean", QUANTITATIVE_2: "max"})`
  - `df[[col1, col2]].groupby(CATEGORICAL).mean()`
- Common aggregation functions:
  - count, mean, max, min, median, std, and more.

### Pivot Table
- Create pivot tables to summarize data:
  - `df.pivot_table(values="MonthlyIncome", index="Department", aggfunc="mean")`
- Pivot tables offer a concise way to aggregate and compare data.

### Crosstab
- Compute cross-tabulations to analyze the relationship between two categorical variables:
  - Default behavior counts occurrences.
  - Use `aggfunc="mean"` for aggregating quantitative variables.
  - Ensure you select appropriate variables.

## JOINS & MERGE & CONCAT

### Concatenation
- Combining DataFrames physically (not relationally):
  - Side by side: `concat` on `axis=1`.
    - Use when DataFrames don't share columns or have a common key.
  - Top & bottom: `concat` on `axis=0` (appending rows).
    - Suitable when DataFrames share columns.

### Merge & Join (Pandas)
- Merge: Combining DataFrames based on common columns.
- Join: Combining DataFrames based on common indices.
- In SQL, join operations are performed on columns.

These recap points summarize key operations for data manipulation and analysis in Pandas. You can use these techniques to select, aggregate, and combine data efficiently, helping you gain insights from your datasets.

## Pandas usual methods
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ​​of a column
df.col.unique() # returns unique values ​​from a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## Further materials

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)